# Создать строку равную предпоследнему символу введенной строки
print('Введите строку символов')
stroka = input()
new_stroka = stroka[-2]
print(new_stroka)
