# Создать строку равную первым пяти символам
# введенной строки
print('Введите строку более пяти символов')
stroka = input()
new_stroka = stroka[0:5]
print(new_stroka)
