# Создать строку равную введенной строке
# безпоследних двух символов
print('Введите строку символов')
stroka = input()
new_stroka = stroka[0:-2]
print(new_stroka)
