# Создать строку равную третьему символу введенной строки.
print('Введите строку более трех символов')
stroka = input()
new_stroka = stroka[2]
print(new_stroka)
