# Дана длина ребра куба. Найти объем куба и
# площадь его боковой поверхности.
print('Введите длину ребра куба')
dlina_rebra = float(input())
v = dlina_rebra ** 3  # находим объем куба
s = dlina_rebra ** 2  # находим площадь боковой поверхности
print('Объем куба', v)
print('Площадь боковой поверхности куба', s)
