#Даны 2 действительных числа a и b. Получить их сумму, разность и произведение. 
print('Введите число a')
a = float(input())
print('Введите число b')
b = float(input())
summa = a + b
raznost = a - b
proizvedenie = a * b
print('Сумма =', summa)
print('Разность =', raznost)
print('Произведение =', proizvedenie)